/* 配列の宣言と初期化の例 */

#include <stdio.h>

int main (){
  int a[10]; /* 要素数10の整数型配列 */
  int b[10]; /* 要素数10の整数型配列 */

  int i; /* カウンタ変数 */

  /* 配列要素の初期化(添え字の値を代入) */
  for(i = 0; i < 10; i++){
    a[i] = i;
  }

  /* 配列aのi番目の要素を2倍して配列bのi番目の要素に代入 */
  for(i = 0; i < 10; i++){
    b[i] = 2*a[i];
  }

  /* 添え字の順番に出力 */
  for(i = 0; i < 10; i++){
    printf("a[%d] = %d, b[%d] = %d\n", i, a[i], i, b[i]);
  }

  /* 添え字の逆順に出力(注:for文の記載内容は変更しないこと) */
  for(i = 0; i < 10; i++){
    printf("a[%d] = %d, b[%d] = %d\n", 9-i, a[9-i], 9-i, b[9-i]);
  }
}
