/*
  プログラミング演習 第1回(5限) 変数とデータ型，計算と式と演算子(例題)
  学籍番号:
  氏   名: 
 */
/* 四則演算のプログラム */
#include<stdio.h>

int main(){
  /* 整数の四則計算 */
  printf("123 + 45 = %d\n", 123 + 45); /* 加算 */
  printf("123 - 45 = %d\n", 123 - 45); /* 減算 */
  printf("123 * 45 = %d\n", 123 * 45); /* 乗算 */
  printf("123 / 45 = %d\n", 123 / 45); /* 除算 */
  printf("123 % 45 = %d\n", 123 % 45); /* 剰余 */
  
  /* 実数の四則計算 */
  printf("12.3 + 4.5 = %lf\n", 12.3 + 4.5); /* 加算 */
  printf("12.3 - 4.5 = %lf\n", 12.3 - 4.5); /* 加算 */
  printf("12.3 * 4.5 = %lf\n", 12.3 * 4.5); /* 加算 */
  printf("12.3 / 4.5 = %lf\n", 12.3 / 4.5); /* 加算 */

  return 0;
}
