/*
  プログラミング演習 第1回(5限) 変数とデータ型，計算と式と演算子(例題)
  学籍番号:
  氏   名: 
 */
/* p.42 代入と型変換 */
#include<stdio.h>

int main(){
  int i, j;
  double x, y;

  i = 3 / 2;			/* 整数同士の割り算 */
  x = 3.0 / 2.0;		/* 実数同士の割り算 */
  y = (double)3 / 2;		/* 整数を実数に型変換 */

  printf("i = %d\n", i);
  printf("x = %lf\n", x);
  printf("y = %lf\n", y);

  x = 2.0 + 3.0 * 4.0;		/* 演算子の優先順位の確認 */
  y = (2.0 + 3.0) * 4.0;	/* 演算子の優先順位の確認 */

  printf("x = %lf\n", x);
  printf("y = %lf\n", y);
  
  x = 3 * 2;			/* 整数同士の演算結果を実数変数に代入 */
  y = 100 + 2.0;		/* 整数と実数の演算結果を実数変数に代入 */

  printf("x = %lf\n", x);
  printf("y = %lf\n", y);

  i = 3;
  x = (2 + i) / 4;		/* 変数を含めた式 */
  printf("x = %lf\n", x);

  return 0;
}
